       IDENTIFICATION DIVISION.
       PROGRAM-ID. BANKING.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ACCOUNT-BALANCE PIC 9(5)V99 VALUE 1000.00.
       01 DEPOSIT-AMOUNT PIC 9(4)V99 VALUE 500.00.
       01 NEW-BALANCE PIC 9(5)V99.

       PROCEDURE DIVISION.
           ADD DEPOSIT-AMOUNT TO ACCOUNT-BALANCE
               GIVING NEW-BALANCE.

           DISPLAY "INITIAL BALANCE: 1000.00".
           DISPLAY "DEPOSIT AMOUNT: 500.00".
           DISPLAY "NEW BALANCE: " NEW-BALANCE.

           STOP RUN.
